InformationRegisters/Сооб_Сообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Сооб_Сообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Comment>Текст сообщения (напоминания)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПолучения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервогоПросмотра</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПереадресации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПометкиНаУдаление</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаМожноУдалять</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Переправил</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокПереадресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноУдалять</Name>
					<Comment>Контроль исполнения автором</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Обсуждение авторм и получателем</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометитьНаУдаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектСообщений</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременноНеУдалять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоЗаблокировал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Comment>Получатель сообщения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор сообщения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗапланированнаяДатаДоставки</Name>
					<Comment>Когда показать сообщение (напоминание)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сооб_ТипСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сооб_Категория</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникИдент</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Сооб_Категория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Сооб_Категория</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КСведению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приоритетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Срочная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнеОчереди</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Сооб_ТипСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>Сооб_ТипСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Напоминание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поручение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтилиОформленияСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтилиОформленияСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Standart</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Today</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Light</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Сооб_Сервер/Ext/Module.bsl
Функция ПроверитьРолиПользователя() Экспорт 
	
	Возврат РольДоступна("Сооб_ПользовательСообщений") ИЛИ РольДоступна("Сооб_АдминистраторСообщений");
	
КонецФункции

Функция ПроверитьИспользованиеСистемыСообщений()Экспорт
	
	Возврат Константы.Сооб_ИспользоватьСообщения.Получить();
	
КонецФункции

Функция ПолучитьВремяПовторения() Экспорт
	
	ВремяПовторения = 0;
	
	Если ЗначениеЗаполнено(ИмяПользователя()) Тогда
		Если ПроверитьРолиПользователя() Тогда
			Если ПроверитьИспользованиеСистемыСообщений() Тогда	
				
				//ВремяПовторения = Константы.Сооб_ПериодПроверкиСообщений.Получить();	
				ВремяПовторения = ПараметрыСеанса.Сооб_ПериодПроверкиСообщений;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВремяПовторения;
	
КонецФункции

Функция СформироватьСписокНовыхСообщений() Экспорт
	
	Массив = Новый Массив;
	
	Запрос = НОВЫЙ Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Сооб_Сообщения.Получатель КАК Получатель,
	|	Сооб_Сообщения.Тема КАК Тема,
	|	Сооб_Сообщения.Автор КАК Автор,
	|	Сооб_Сообщения.ТипСообщения КАК ТипСообщения,   
	|	Сооб_Сообщения.Категория КАК Категория,
	|	Сооб_Сообщения.ЗапланированнаяДатаДоставки КАК ЗапланированнаяДатаДоставки,
	|	Сооб_Сообщения.УникИдент КАК УникИдент
	|ИЗ
	|	РегистрСведений.Сооб_Сообщения КАК Сооб_Сообщения
	|ГДЕ
	|	Сооб_Сообщения.Получатель = &Получатель
	|	И (Сооб_Сообщения.ЗапланированнаяДатаДоставки <= &ТекущаяДата
	|				И Сооб_Сообщения.ДатаПервогоПросмотра = &ПустаяДата)   
	|
	|";
	
	//Запрос.УстановитьПараметр("Получатель", Пользователи.ТекущийПользователь());
    Запрос.УстановитьПараметр("Получатель", ПараметрыСеанса.Пользователь); 
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101000000'));
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Если РЗ.Количество() > 0 Тогда
		
		Для КАЖДОГО текЗап ИЗ РЗ Цикл
			
			СтруктураЗаписи = Новый Структура;
			СтруктураЗаписи.Вставить("Получатель",текЗап.Получатель);
			СтруктураЗаписи.Вставить("Тема",текЗап.Тема);
			СтруктураЗаписи.Вставить("Автор",текЗап.Автор);
			СтруктураЗаписи.Вставить("ТипСообщения",текЗап.ТипСообщения);
			СтруктураЗаписи.Вставить("Категория",текЗап.Категория);
			СтруктураЗаписи.Вставить("ЗапланированнаяДатаДоставки",текЗап.ЗапланированнаяДатаДоставки);
			СтруктураЗаписи.Вставить("УникИдент",текЗап.УникИдент);
			
			КлючЗаписи = РегистрыСведений.Сооб_Сообщения.СоздатьКлючЗаписи(СтруктураЗаписи);
			
			СтруктураКлюча = Новый Структура;
			СтруктураКлюча.Вставить("Ключ",КлючЗаписи);
			СтруктураКлюча.Вставить("Реквизиты",СтруктураЗаписи);
			
			Массив.Добавить(СтруктураКлюча);
			
		КонецЦикла;
		
		Возврат Массив;
		
	Иначе
		
		Возврат НЕОПРЕДЕЛЕНО;
		
	КонецЕсли;
	
КонецФункции

Функция СформироватьСписокНовыхСообщенийВнеОчереди() Экспорт

	Массив = Новый Массив;     
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ Разрешенные
	               |	Сооб_Сообщения.Получатель КАК Получатель,
	               |	Сооб_Сообщения.Тема КАК Тема,
	               |	Сооб_Сообщения.Автор КАК Автор,
	               |	Сооб_Сообщения.ТипСообщения КАК ТипСообщения,
	               |	Сооб_Сообщения.Категория КАК Категория,
	               |	Сооб_Сообщения.ЗапланированнаяДатаДоставки КАК ЗапланированнаяДатаДоставки,
	               |	Сооб_Сообщения.УникИдент КАК УникИдент,
	               |	Сооб_Сообщения.Сообщение КАК Сообщение
	               |ИЗ
	               |	РегистрСведений.Сооб_Сообщения КАК Сооб_Сообщения
	               |ГДЕ
	               |	НЕ Сооб_Сообщения.Выполнено
	               |	И Сооб_Сообщения.Категория = &Категория
	               |	И Сооб_Сообщения.Получатель = &Получатель
	               |	И &ТекущаяДата МЕЖДУ Сооб_Сообщения.ЗапланированнаяДатаДоставки И Сооб_Сообщения.ДатаМожноУдалять
	               |	И Сооб_Сообщения.ДатаПервогоПросмотра = &ПустаяДата";
	
	//Запрос.УстановитьПараметр("Получатель", Пользователи.ТекущийПользователь());
    Запрос.УстановитьПараметр("Получатель", ПараметрыСеанса.Пользователь); 
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101000000'));
	Запрос.УстановитьПараметр("Категория", Перечисления.Сооб_Категория.ВнеОчереди);
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Для КАЖДОГО текЗап ИЗ РЗ Цикл
		
		СтруктураЗаписи = Новый Структура;
		СтруктураЗаписи.Вставить("Получатель",	текЗап.Получатель);
		СтруктураЗаписи.Вставить("Тема",		текЗап.Тема);
		СтруктураЗаписи.Вставить("Автор",		текЗап.Автор);
		СтруктураЗаписи.Вставить("ТипСообщения",текЗап.ТипСообщения);
		СтруктураЗаписи.Вставить("Категория",	текЗап.Категория);
		СтруктураЗаписи.Вставить("ЗапланированнаяДатаДоставки",текЗап.ЗапланированнаяДатаДоставки);
		СтруктураЗаписи.Вставить("УникИдент",	текЗап.УникИдент);
		СтруктураЗаписи.Вставить("Сообщение",	текЗап.Сообщение);
		
		КлючЗаписи = РегистрыСведений.Сооб_Сообщения.СоздатьКлючЗаписи(СтруктураЗаписи);
		
		СтруктураКлюча = Новый Структура;
		СтруктураКлюча.Вставить("Ключ",КлючЗаписи);
		СтруктураКлюча.Вставить("Реквизиты",СтруктураЗаписи);
		
		Массив.Добавить(СтруктураКлюча);
		
	КонецЦикла;
	
	Возврат Массив;

КонецФункции

Функция ПолучитьКартинкуДляСообщения(ТипСообщ) ЭКСПОРТ
	
	текКартинка = БиблиотекаКартинок.СообщениеОранж;
	
	Если ТипСообщ = Перечисления.Сооб_ТипСообщения.Напоминание Тогда
		
		Возврат БиблиотекаКартинок.СообщениеЗеленое;
		
	ИначеЕсли ТипСообщ = Перечисления.Сооб_ТипСообщения.Поручение Тогда
		
		Возврат БиблиотекаКартинок.СообщениеКрасное;
		
	ИначеЕсли ТипСообщ = Перечисления.Сооб_ТипСообщения.Сообщение Тогда
		
		Возврат БиблиотекаКартинок.СообщениеСинее;
		
	КонецЕсли;
	
	Возврат текКартинка;
	
КонецФункции

Функция ПолучитьСтатусСообщения(текКатегория) ЭКСПОРТ
	
	текСтатус = СтатусОповещенияПользователя.Важное;
	
	Возврат текСтатус;
	
КонецФункции

Процедура ПодпискаНаСобытиеОбработкаПолученияФормы(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если ВидФормы = "ФормаЗаписи" Тогда
		
		//Проверим что первое открытие получателем сообщения и установим Дату первого просмотра
		
		Если Параметры.Свойство("Ключ",) Тогда  //Это открытие существующего 
			
			ЭтоПервоеОткрытие = ПроверитьЧтоПервоеОткрытиеПолучателем(Параметры.Ключ);
			
			Если ЭтоПервоеОткрытие Тогда
				
				НужнаяЗапись = РегистрыСведений.Сооб_Сообщения.СоздатьМенеджерЗаписи();
				
				НужнаяЗапись.Получатель = Параметры.Ключ.Получатель;
				НужнаяЗапись.Автор = Параметры.Ключ.Автор;
				НужнаяЗапись.ЗапланированнаяДатаДоставки = Параметры.Ключ.ЗапланированнаяДатаДоставки;
				НужнаяЗапись.ТипСообщения = Параметры.Ключ.ТипСообщения;
				НужнаяЗапись.Категория = Параметры.Ключ.Категория;
				НужнаяЗапись.УникИдент = Параметры.Ключ.УникИдент;
				
				НужнаяЗапись.Прочитать();
				
				Если НужнаяЗапись.Выбран() Тогда
					
					УстановитьПривилегированныйРежим(Истина);
					
					Если НужнаяЗапись.ДатаПервогоПросмотра = Дата('00010101000000') Тогда
						
						НужнаяЗапись.ДатаПервогоПросмотра = ТекущаяДата();
						НужнаяЗапись.Записать();
						
					КонецЕсли;
					
					УстановитьПривилегированныйРежим(ЛОЖЬ);
					
				КонецЕсли;				 
				
				Отбор = Новый Структура;
				Отбор.Вставить("Получатель", Параметры.Ключ.Получатель);
				Отбор.Вставить("Автор", Параметры.Ключ.Автор);
				Отбор.Вставить("ЗапланированнаяДатаДоставки", Параметры.Ключ.ЗапланированнаяДатаДоставки);
				Отбор.Вставить("ТипСообщения", Параметры.Ключ.ТипСообщения);
				Отбор.Вставить("Категория", Параметры.Ключ.Категория);
				Отбор.Вставить("УникИдент", Параметры.Ключ.УникИдент);
				
				НужнаяЗапись = РегистрыСведений.Сооб_Сообщения.Получить(Отбор);
				
			КонецЕсли;
			
		ИНАЧЕ
			//Это копирование или создание нового
			
			
		КонецЕсли;
		
	ИначеЕсли  ВидФормы = "ФормаСписка" Тогда
		
		
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьЧтоПервоеОткрытиеПолучателем(КлючНужнойЗаписи) ЭКСПОРТ
	
	Запрос = НОВЫЙ Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Сооб_Сообщения.УникИдент КАК УникИдент
	|ИЗ
	|	РегистрСведений.Сооб_Сообщения КАК Сооб_Сообщения
	|ГДЕ
	|	Сооб_Сообщения.Получатель = &Получатель
	|	И Сооб_Сообщения.Автор = &Автор
	|	И Сооб_Сообщения.ЗапланированнаяДатаДоставки = &ЗапланированнаяДатаДоставки
	|	И Сооб_Сообщения.ТипСообщения = &ТипСообщения
	|	И Сооб_Сообщения.Категория = &Категория
	|	И Сооб_Сообщения.УникИдент = &УникИдент
	|	И Сооб_Сообщения.ДатаПервогоПросмотра = &ПустаяДата";
	
	//Запрос.УстановитьПараметр("Получатель", Пользователи.ТекущийПользователь() ); 
	Запрос.УстановитьПараметр("Получатель", ПараметрыСеанса.Пользователь); 
	Запрос.УстановитьПараметр("Автор", КлючНужнойЗаписи.Автор ); 
	Запрос.УстановитьПараметр("ЗапланированнаяДатаДоставки", КлючНужнойЗаписи.ЗапланированнаяДатаДоставки ); 
	Запрос.УстановитьПараметр("ТипСообщения", КлючНужнойЗаписи.ТипСообщения ); 
	Запрос.УстановитьПараметр("Категория", КлючНужнойЗаписи.Категория ); 
	Запрос.УстановитьПараметр("УникИдент", КлючНужнойЗаписи.УникИдент ); 
	Запрос.УстановитьПараметр("ПустаяДата", Дата('00010101000000'));
	
	РЗ = Запрос.Выполнить().Выгрузить();
	
	Если РЗ.Количество() = 1 Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Функция ПустаяДата() ЭКСПОРТ
	
	Возврат Дата('00010101000000');
	
КонецФункции

Функция ПустойПользователь() ЭКСПОРТ
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции

Функция ПроверитьНаличиеРоли(Польз) Экспорт
	
	УстановитьПривилегированныйРежим (ИСТИНА);
	
	Если НЕ ЗначениеЗаполнено(Польз.ИдентификаторПользователяИБ) Тогда
		Возврат Ложь;	
	КонецЕсли;

	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Польз.ИдентификаторПользователяИБ);
	
	Если (ПользовательИБ.Роли.Содержит(Метаданные.Роли["Сооб_ПользовательСообщений"]))
		ИЛИ (ПользовательИБ.Роли.Содержит(Метаданные.Роли["Сооб_АдминистраторСообщений"])) Тогда
		
		УстановитьПривилегированныйРежим (ЛОЖЬ);
		
		Возврат Истина;
		
	Иначе
		
		УстановитьПривилегированныйРежим (ЛОЖЬ);
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

Функция ДоступнаРольАдминистратора() Экспорт
	
	Возврат РольДоступна("Сооб_АдминистраторСообщений");
	
КонецФункции

Процедура Сооб_ЗаписьКонстант(Источник, Отказ) Экспорт
	
	Если НЕ РольДоступна("Сооб_АдминистраторСообщений") Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	
КонецПроцедуры

Процедура АдминистраторУдалениеОтмеченныхСообщений() Экспорт
	
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если Константы.Сооб_АвтоматическиУдалять.Получить() Тогда
			
			РС_Сообщ = РегистрыСведений.Сооб_Сообщения;
			
			ВыборкаСообщ = РС_Сообщ.Выбрать();
			
			Пока ВыборкаСообщ.Следующий() Цикл
				
				Если ВыборкаСообщ.ВременноНеУдалять Тогда
					
					Продолжить;
					
				КонецЕсли;
				
				Если ВыборкаСообщ.ПометитьНаУдаление Тогда
					
					ВремяЗадержкиУдаления = Константы.Сооб_ДнейДоУдаления.Получить() * 86400;
					
					Если ВыборкаСообщ.ДатаПометкиНаУдаление <= (ТекущаяДата() + ВремяЗадержкиУдаления) Тогда  //Четверо суток на раскачку
							
							Если ВыборкаСообщ.ТипСообщения = Перечисления.Сооб_ТипСообщения.Поручение Тогда
								
								Если ВыборкаСообщ.МожноУдалять Тогда
									
									ВыборкаСообщ.ПолучитьМенеджерЗаписи().Удалить();
									
								КонецЕсли;
								
							Иначе
								
								ВыборкаСообщ.ПолучитьМенеджерЗаписи().Удалить();
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
			УстановитьПривилегированныйРежим(ЛОЖЬ);
			
		Исключение
			
			ВызватьИсключение(НСтр("ru = 'Ошибка удаления сообщений'; en = 'Error deleting messages'")); 
			
		КонецПопытки;
	
	КонецПроцедуры
	
	
// © Primus1C  08.09.2023  НАЧАЛО ►

Процедура УдалитьЗапись(Отбор) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.Сооб_Сообщения.СоздатьМенеджерЗаписи();
	НаборЗаписей.УникИдент 					= Отбор.УникИдент;
	НаборЗаписей.Получатель					= Отбор.Получатель;
	НаборЗаписей.Автор      				= Отбор.Автор;
	НаборЗаписей.ЗапланированнаяДатаДоставки= Отбор.ЗапланированнаяДатаДоставки;
	НаборЗаписей.ТипСообщения  				= Отбор.ТипСообщения;
	НаборЗаписей.Категория    				= Отбор.Категория;
	НаборЗаписей.Прочитать();
	НаборЗаписей.Удалить();

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Функция Инициалы(Знач ИмяПользователя)
	
	ИмяПользователя = СокрЛП(СтрЗаменить(ИмяПользователя, "_", " "));
	поз = Найти(ИмяПользователя, " ");
    Если поз = 0 Тогда
		Возврат Врег(Лев(ИмяПользователя, 2));	
	Иначе   
		ИмяПользователя = Лев(ИмяПользователя,1) + Сред(ИмяПользователя,поз+1,1);
		Возврат Врег(ИмяПользователя);	
	КонецЕсли;

КонецФункции 

Функция СообщенияОбъекта(ОбъектСсылка) Экспорт

	СтрокаВложHTML = "";
	ФорматДаты = "Л=" + НСтр("ru = 'ru'; en = 'en'") + "; ДФ='d MMMM HH:mm'";
	
	Запр = Новый Запрос;  
	//Запр.УстановитьПараметр("Получатель", гоПользователь());
	Запр.УстановитьПараметр("СсылкаНаОбъект", ОбъектСсылка);
	Запр.Текст = "ВЫБРАТЬ Разрешенные
	             |	Сооб_Сообщения.Автор,
	             |	Сооб_Сообщения.Автор.Код КАК КодПользователя,
	             |	Сооб_Сообщения.Тема,
	             |	Сооб_Сообщения.Сообщение,
	             |	Сооб_Сообщения.ДатаСоздания,
	             |	Сооб_Сообщения.ТипСообщения,
	             |	Сооб_Сообщения.Категория,
	             |	Сооб_Сообщения.ДатаПервогоПросмотра,
	             |	Сооб_Сообщения.СсылкаНаОбъект,
	             |	Сооб_Сообщения.Выполнено,
	             |	Сооб_Сообщения.ДатаВыполнения,
	             |	Сооб_Сообщения.Получатель,
	             |	Сооб_Сообщения.УникИдент КАК ИД
	             |ИЗ
	             |	РегистрСведений.Сооб_Сообщения КАК Сооб_Сообщения
	             |ГДЕ
	             |	Сооб_Сообщения.СсылкаНаОбъект = &СсылкаНаОбъект
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДатаСоздания";
    Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Количество() = 0 Тогда
		СтрокаВложHTML = ПолучитьОбщийМакет("component_li_empty").ПолучитьТекст(); 
		ОчиститьСтрокуHTML(СтрокаВложHTML);
	Иначе
		Пока Выборка.Следующий() Цикл
			ПодСтрокаHTML = ПолучитьОбщийМакет("component_li").ПолучитьТекст(); 
			ОчиститьСтрокуHTML(ПодСтрокаHTML);
			ПараметрыHTML = Новый Структура("Инициалы, Автор, Сообщение, Создано, Просмотрено, ИД_Ответа, ИД_Выполнить, ДатаВыполнения",
											Инициалы(Выборка.Автор), 
											Выборка.Автор, 
											Выборка.Сообщение, 
											Формат(Выборка.ДатаСоздания, ФорматДаты), 
											Формат(Выборка.ДатаПервогоПросмотра, ФорматДаты),
											"answer_"+СокрЛП(Выборка.КодПользователя),
											"doit_"+Выборка.ИД,
											Формат(Выборка.ДатаВыполнения, ФорматДаты),
			 								); 
			Если Выборка.ТипСообщения = Перечисления.Сооб_ТипСообщения.Поручение Тогда
				Если Выборка.Выполнено Тогда
					ПодСтрокаHTML = СтрЗаменить(ПодСтрокаHTML, "<component_li_completed></component_li_completed>", ПолучитьОбщийМакет("component_li_completed").ПолучитьТекст()); 
				ИначеЕсли Выборка.Получатель = гоПользователь() Тогда
					ПодСтрокаHTML = СтрЗаменить(ПодСтрокаHTML, "<component_li_doit></component_li_doit>", ПолучитьОбщийМакет("component_li_doit").ПолучитьТекст()); 
				Иначе
					ПодСтрокаHTML = СтрЗаменить(ПодСтрокаHTML, "<component_li_doit></component_li_doit>", ""); 
					ПодСтрокаHTML = СтрЗаменить(ПодСтрокаHTML, "<component_li_completed></component_li_completed>", ""); 
				КонецЕсли;
			Иначе
				ПодСтрокаHTML = СтрЗаменить(ПодСтрокаHTML, "<component_li_doit></component_li_doit>", ""); 
				ПодСтрокаHTML = СтрЗаменить(ПодСтрокаHTML, "<component_li_completed></component_li_completed>", ""); 
			КонецЕсли;								
		    ЗаполнитьПараметрыHTML(ПодСтрокаHTML, ПараметрыHTML);
			СтрокаВложHTML = СтрокаВложHTML + ПодСтрокаHTML;
		КонецЦикла; 
	КонецЕсли;
	
	СтрокаHTML = ПолучитьОбщийМакет("component_body").ПолучитьТекст(); 
	
	Стиль = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("СтильОформленияСообщений");
	Если Стиль = Перечисления.СтилиОформленияСообщений.Standart Тогда
 	  	СтрокаСтильHTML = ":root {
				 			|--background-color: #f4f0dc;
				 			|--text-color: #000000;
				 			|--person-color: #febc65;
				 			|--message-background-color: #fcfaeb;
				 			|--user-name-color: #162779; 
				 			|--details-text-color: #b3ac86; 
				 			|--details-icon-color: #b3ac86;
				 			|--details-hilight-color: #000000;
				 			|--info-color: #1c55ae;
							|}"; 
	ИначеЕсли Стиль = Перечисления.СтилиОформленияСообщений.Today Тогда
    	СтрокаСтильHTML = ":root {
				 			|--background-color: #181b34;
				 			|--text-color: #ffffff;
				 			|--person-color: #9dd421;
				 			|--message-background-color: #393b53;
				 			|--user-name-color: #0073ea; 
				 			|--details-text-color: #9699a6; 
				 			|--details-icon-color: #d5d8df;
				 			|--details-hilight-color: #0073ea;
				 			|--info-color: #0073ea;
							|}"; 
	Иначе // Light
    	СтрокаСтильHTML = ":root {
				 			|--background-color: #ffffff;
				 			|--text-color: #323338;
				 			|--person-color: #fdad3a;
				 			|--message-background-color: #eceff8;
				 			|--user-name-color: #323338; 
				 			|--details-text-color: #999999; 
				 			|--details-icon-color: #999999;
				 			|--details-hilight-color: #000000;
				 			|--info-color: #ff642a;
							|}"; 
	КонецЕсли;
	СтрокаHTML = СтрЗаменить(СтрокаHTML, ":root {}", СтрокаСтильHTML);
	
	СтрокаHTML = СтрЗаменить(СтрокаHTML, "<component_li></component_li>", СтрокаВложHTML);
	ЗаполнитьПараметрыHTML(СтрокаHTML, Новый Структура("Обновлено", Формат(ТекущаяДатаСеанса(),"ДЛФ=T")));
	
	Возврат Новый Структура("СтрокаHTML,КоличествоСообщений", СтрокаHTML, Выборка.Количество());

КонецФункции // СтрокаHTML()

Процедура ОчиститьСтрокуHTML(СтрокаHTML)
	
	СтрокаHTML = СтрЗаменить(СтрокаHTML, "<html>",  "");
	СтрокаHTML = СтрЗаменить(СтрокаHTML, "</html>", "");
	СтрокаHTML = СтрЗаменить(СтрокаHTML, "<body>",  "");
	СтрокаHTML = СтрЗаменить(СтрокаHTML, "</body>", "");
	
	поз1 = Найти(СтрокаHTML, "<head><base ");
	Если поз1 > 0 Тогда
		поз2 = Найти(СтрокаHTML, "></base></head>");	
		СтрокаЗамены = Сред(СтрокаHTML, поз1, поз2+15 - поз1);	
	    СтрокаHTML = СтрЗаменить(СтрокаHTML, СтрокаЗамены, "");
	КонецЕсли;

КонецПроцедуры

Функция ЗаполнитьПараметрыHTML(СтрокаHTML, ПараметрыHTML)

	Для каждого Пар Из ПараметрыHTML Цикл
		СтрокаHTML = СтрЗаменить(СтрокаHTML, "{{"+Пар.Ключ+"}}", пар.Значение);
	КонецЦикла;

КонецФункции // ЗаполнитьПараметрыHTML()

Функция ПериодОбновленияЧата() Экспорт

	Возврат ПараметрыСеанса.Сооб_ПериодОбновленияЧата;	

КонецФункции // ПериодОбновленияЧата()

// © Primus1C  ОКОНЧАНИЕ ◄
